app/controllers/parchees_controller.rb

INSERT INTO `parchees` (`user_latitude`, `updated_at`, `title`, `delete_flg`, `date`, `right_now_flg`, `deleted_at`, `content`, `user_id`, `user_longitude`, `created_at`) VALUES(0, '2009-05-28 16:14:35', '8', NULL, NULL, 1, NULL, '8', NULL, 0, '2009-05-28 16:14:35')
---
  def create
    @parchee = Parchee.new(params[:parchee])
    @parchee.date = nil if @parchee.right_now_flg == true
    if @parchee.save